7767517
175 221
Input                    Input_0                  0 1 input0
Input                    Input_1                  0 1 input1
Convolution              Conv_11                  1 1 input0 967 0=16 1=3 3=2 4=1 5=1 6=432 9=2 -23310=1,1.000000e-01
Convolution              Conv_13                  1 1 967 969 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-01
Convolution              Conv_15                  1 1 969 971 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-01
Convolution              Conv_17                  1 1 input1 973 0=16 1=3 3=2 4=1 5=1 6=432 9=2 -23310=1,1.000000e-01
Convolution              Conv_19                  1 1 973 975 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-01
Convolution              Conv_21                  1 1 975 977 0=16 1=3 4=1 5=1 6=2304 9=2 -23310=1,1.000000e-01
Convolution              Conv_23                  1 1 971 979 0=32 1=3 3=2 4=1 5=1 6=4608 9=2 -23310=1,1.000000e-01
Convolution              Conv_25                  1 1 979 981 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              Conv_27                  1 1 981 983 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Split                    splitncnn_1              1 3 983 983_splitncnn_0 983_splitncnn_1 983_splitncnn_2
Convolution              Conv_29                  1 1 977 985 0=32 1=3 3=2 4=1 5=1 6=4608 9=2 -23310=1,1.000000e-01
Convolution              Conv_31                  1 1 985 987 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Convolution              Conv_33                  1 1 987 989 0=32 1=3 4=1 5=1 6=9216 9=2 -23310=1,1.000000e-01
Split                    splitncnn_2              1 2 989 989_splitncnn_0 989_splitncnn_1
Convolution              Conv_35                  1 1 983_splitncnn_2 991 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,1.000000e-01
Convolution              Conv_37                  1 1 991 993 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Convolution              Conv_39                  1 1 993 995 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Split                    splitncnn_3              1 3 995 995_splitncnn_0 995_splitncnn_1 995_splitncnn_2
Convolution              Conv_41                  1 1 989_splitncnn_1 997 0=64 1=3 3=2 4=1 5=1 6=18432 9=2 -23310=1,1.000000e-01
Convolution              Conv_43                  1 1 997 999 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Convolution              Conv_45                  1 1 999 1001 0=64 1=3 4=1 5=1 6=36864 9=2 -23310=1,1.000000e-01
Split                    splitncnn_4              1 2 1001 1001_splitncnn_0 1001_splitncnn_1
Convolution              Conv_47                  1 1 995_splitncnn_2 1003 0=96 1=3 3=2 4=1 5=1 6=55296 9=2 -23310=1,1.000000e-01
Convolution              Conv_49                  1 1 1003 1005 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Convolution              Conv_51                  1 1 1005 1007 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Split                    splitncnn_5              1 3 1007 1007_splitncnn_0 1007_splitncnn_1 1007_splitncnn_2
Convolution              Conv_53                  1 1 1001_splitncnn_1 1009 0=96 1=3 3=2 4=1 5=1 6=55296 9=2 -23310=1,1.000000e-01
Convolution              Conv_55                  1 1 1009 1011 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Convolution              Conv_57                  1 1 1011 1013 0=96 1=3 4=1 5=1 6=82944 9=2 -23310=1,1.000000e-01
Split                    splitncnn_6              1 2 1013 1013_splitncnn_0 1013_splitncnn_1
Convolution              Conv_59                  1 1 1007_splitncnn_2 1015 0=128 1=3 3=2 4=1 5=1 6=110592 9=2 -23310=1,1.000000e-01
Convolution              Conv_61                  1 1 1015 1017 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-01
Convolution              Conv_63                  1 1 1017 1019 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-01
Split                    splitncnn_7              1 3 1019 1019_splitncnn_0 1019_splitncnn_1 1019_splitncnn_2
Convolution              Conv_65                  1 1 1013_splitncnn_1 1021 0=128 1=3 3=2 4=1 5=1 6=110592 9=2 -23310=1,1.000000e-01
Convolution              Conv_67                  1 1 1021 1023 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-01
Convolution              Conv_69                  1 1 1023 1025 0=128 1=3 4=1 5=1 6=147456 9=2 -23310=1,1.000000e-01
Split                    splitncnn_8              1 2 1025 1025_splitncnn_0 1025_splitncnn_1
Convolution              Conv_71                  1 1 1019_splitncnn_2 1027 0=196 1=3 3=2 4=1 5=1 6=225792 9=2 -23310=1,1.000000e-01
Convolution              Conv_73                  1 1 1027 1029 0=196 1=3 4=1 5=1 6=345744 9=2 -23310=1,1.000000e-01
Convolution              Conv_75                  1 1 1029 1031 0=196 1=3 4=1 5=1 6=345744 9=2 -23310=1,1.000000e-01
Convolution              Conv_77                  1 1 1025_splitncnn_1 1033 0=196 1=3 3=2 4=1 5=1 6=225792 9=2 -23310=1,1.000000e-01
Convolution              Conv_79                  1 1 1033 1035 0=196 1=3 4=1 5=1 6=345744 9=2 -23310=1,1.000000e-01
Convolution              Conv_81                  1 1 1035 1037 0=196 1=3 4=1 5=1 6=345744 9=2 -23310=1,1.000000e-01
dain.Correlation         Corr_1043                2 1 1031 1037 1043
ReLU                     LeakyRelu_89             1 1 1043 1044 0=1.000000e-01
Split                    splitncnn_9              1 2 1044 1044_splitncnn_0 1044_splitncnn_1
Convolution              Conv_90                  1 1 1044_splitncnn_1 1046 0=128 1=3 4=1 5=1 6=93312 9=2 -23310=1,1.000000e-01
Concat                   Concat_92                2 1 1046 1044_splitncnn_0 1047
Split                    splitncnn_10             1 2 1047 1047_splitncnn_0 1047_splitncnn_1
Convolution              Conv_93                  1 1 1047_splitncnn_1 1049 0=128 1=3 4=1 5=1 6=240768 9=2 -23310=1,1.000000e-01
Concat                   Concat_95                2 1 1049 1047_splitncnn_0 1050
Split                    splitncnn_11             1 2 1050 1050_splitncnn_0 1050_splitncnn_1
Convolution              Conv_96                  1 1 1050_splitncnn_1 1052 0=96 1=3 4=1 5=1 6=291168 9=2 -23310=1,1.000000e-01
Concat                   Concat_98                2 1 1052 1050_splitncnn_0 1053
Split                    splitncnn_12             1 2 1053 1053_splitncnn_0 1053_splitncnn_1
Convolution              Conv_99                  1 1 1053_splitncnn_1 1055 0=64 1=3 4=1 5=1 6=249408 9=2 -23310=1,1.000000e-01
Concat                   Concat_101               2 1 1055 1053_splitncnn_0 1056
Split                    splitncnn_13             1 2 1056 1056_splitncnn_0 1056_splitncnn_1
Convolution              Conv_102                 1 1 1056_splitncnn_1 1058 0=32 1=3 4=1 5=1 6=143136 9=2 -23310=1,1.000000e-01
Concat                   Concat_104               2 1 1058 1056_splitncnn_0 1059
Split                    splitncnn_14             1 2 1059 1059_splitncnn_0 1059_splitncnn_1
Convolution              Conv_105                 1 1 1059_splitncnn_1 1060 0=2 1=3 4=1 5=1 6=9522
Deconvolution            ConvTranspose_106        1 1 1060 1061 0=2 1=4 3=2 4=1 5=1 6=64
Split                    splitncnn_15             1 2 1061 1061_splitncnn_0 1061_splitncnn_1
Deconvolution            ConvTranspose_107        1 1 1059_splitncnn_0 1062 0=2 1=4 3=2 4=1 5=1 6=16928
BinaryOp                 Mul_109                  1 1 1061_splitncnn_1 1064 0=2 1=1 2=6.250000e-01
dain.OpticalFlowWarp     OpticalFlowWarp_1070     2 1 1025_splitncnn_0 1064 1070
dain.Correlation         Corr_1076                2 1 1019_splitncnn_1 1070 1076
ReLU                     LeakyRelu_122            1 1 1076 1077 0=1.000000e-01
Concat                   Concat_123               4 1 1077 1019_splitncnn_0 1061_splitncnn_0 1062 1078
Split                    splitncnn_16             1 2 1078 1078_splitncnn_0 1078_splitncnn_1
Convolution              Conv_124                 1 1 1078_splitncnn_1 1080 0=128 1=3 4=1 5=1 6=245376 9=2 -23310=1,1.000000e-01
Concat                   Concat_126               2 1 1080 1078_splitncnn_0 1081
Split                    splitncnn_17             1 2 1081 1081_splitncnn_0 1081_splitncnn_1
Convolution              Conv_127                 1 1 1081_splitncnn_1 1083 0=128 1=3 4=1 5=1 6=392832 9=2 -23310=1,1.000000e-01
Concat                   Concat_129               2 1 1083 1081_splitncnn_0 1084
Split                    splitncnn_18             1 2 1084 1084_splitncnn_0 1084_splitncnn_1
Convolution              Conv_130                 1 1 1084_splitncnn_1 1086 0=96 1=3 4=1 5=1 6=405216 9=2 -23310=1,1.000000e-01
Concat                   Concat_132               2 1 1086 1084_splitncnn_0 1087
Split                    splitncnn_19             1 2 1087 1087_splitncnn_0 1087_splitncnn_1
Convolution              Conv_133                 1 1 1087_splitncnn_1 1089 0=64 1=3 4=1 5=1 6=325440 9=2 -23310=1,1.000000e-01
Concat                   Concat_135               2 1 1089 1087_splitncnn_0 1090
Split                    splitncnn_20             1 2 1090 1090_splitncnn_0 1090_splitncnn_1
Convolution              Conv_136                 1 1 1090_splitncnn_1 1092 0=32 1=3 4=1 5=1 6=181152 9=2 -23310=1,1.000000e-01
Concat                   Concat_138               2 1 1092 1090_splitncnn_0 1093
Split                    splitncnn_21             1 2 1093 1093_splitncnn_0 1093_splitncnn_1
Convolution              Conv_139                 1 1 1093_splitncnn_1 1094 0=2 1=3 4=1 5=1 6=11898
Deconvolution            ConvTranspose_140        1 1 1094 1095 0=2 1=4 3=2 4=1 5=1 6=64
Split                    splitncnn_22             1 2 1095 1095_splitncnn_0 1095_splitncnn_1
Deconvolution            ConvTranspose_141        1 1 1093_splitncnn_0 1096 0=2 1=4 3=2 4=1 5=1 6=21152
BinaryOp                 Mul_143                  1 1 1095_splitncnn_1 1098 0=2 1=1 2=1.250000e+00
dain.OpticalFlowWarp     OpticalFlowWarp_1104     2 1 1013_splitncnn_0 1098 1104
dain.Correlation         Corr_1110                2 1 1007_splitncnn_1 1104 1110
ReLU                     LeakyRelu_156            1 1 1110 1111 0=1.000000e-01
Concat                   Concat_157               4 1 1111 1007_splitncnn_0 1095_splitncnn_0 1096 1112
Split                    splitncnn_23             1 2 1112 1112_splitncnn_0 1112_splitncnn_1
Convolution              Conv_158                 1 1 1112_splitncnn_1 1114 0=128 1=3 4=1 5=1 6=208512 9=2 -23310=1,1.000000e-01
Concat                   Concat_160               2 1 1114 1112_splitncnn_0 1115
Split                    splitncnn_24             1 2 1115 1115_splitncnn_0 1115_splitncnn_1
Convolution              Conv_161                 1 1 1115_splitncnn_1 1117 0=128 1=3 4=1 5=1 6=355968 9=2 -23310=1,1.000000e-01
Concat                   Concat_163               2 1 1117 1115_splitncnn_0 1118
Split                    splitncnn_25             1 2 1118 1118_splitncnn_0 1118_splitncnn_1
Convolution              Conv_164                 1 1 1118_splitncnn_1 1120 0=96 1=3 4=1 5=1 6=377568 9=2 -23310=1,1.000000e-01
Concat                   Concat_166               2 1 1120 1118_splitncnn_0 1121
Split                    splitncnn_26             1 2 1121 1121_splitncnn_0 1121_splitncnn_1
Convolution              Conv_167                 1 1 1121_splitncnn_1 1123 0=64 1=3 4=1 5=1 6=307008 9=2 -23310=1,1.000000e-01
Concat                   Concat_169               2 1 1123 1121_splitncnn_0 1124
Split                    splitncnn_27             1 2 1124 1124_splitncnn_0 1124_splitncnn_1
Convolution              Conv_170                 1 1 1124_splitncnn_1 1126 0=32 1=3 4=1 5=1 6=171936 9=2 -23310=1,1.000000e-01
Concat                   Concat_172               2 1 1126 1124_splitncnn_0 1127
Split                    splitncnn_28             1 2 1127 1127_splitncnn_0 1127_splitncnn_1
Convolution              Conv_173                 1 1 1127_splitncnn_1 1128 0=2 1=3 4=1 5=1 6=11322
Deconvolution            ConvTranspose_174        1 1 1128 1129 0=2 1=4 3=2 4=1 5=1 6=64
Split                    splitncnn_29             1 2 1129 1129_splitncnn_0 1129_splitncnn_1
Deconvolution            ConvTranspose_175        1 1 1127_splitncnn_0 1130 0=2 1=4 3=2 4=1 5=1 6=20128
BinaryOp                 Mul_177                  1 1 1129_splitncnn_1 1132 0=2 1=1 2=2.500000e+00
dain.OpticalFlowWarp     OpticalFlowWarp_1138     2 1 1001_splitncnn_0 1132 1138
dain.Correlation         Corr_1144                2 1 995_splitncnn_1 1138 1144
ReLU                     LeakyRelu_190            1 1 1144 1145 0=1.000000e-01
Concat                   Concat_191               4 1 1145 995_splitncnn_0 1129_splitncnn_0 1130 1146
Split                    splitncnn_30             1 2 1146 1146_splitncnn_0 1146_splitncnn_1
Convolution              Conv_192                 1 1 1146_splitncnn_1 1148 0=128 1=3 4=1 5=1 6=171648 9=2 -23310=1,1.000000e-01
Concat                   Concat_194               2 1 1148 1146_splitncnn_0 1149
Split                    splitncnn_31             1 2 1149 1149_splitncnn_0 1149_splitncnn_1
Convolution              Conv_195                 1 1 1149_splitncnn_1 1151 0=128 1=3 4=1 5=1 6=319104 9=2 -23310=1,1.000000e-01
Concat                   Concat_197               2 1 1151 1149_splitncnn_0 1152
Split                    splitncnn_32             1 2 1152 1152_splitncnn_0 1152_splitncnn_1
Convolution              Conv_198                 1 1 1152_splitncnn_1 1154 0=96 1=3 4=1 5=1 6=349920 9=2 -23310=1,1.000000e-01
Concat                   Concat_200               2 1 1154 1152_splitncnn_0 1155
Split                    splitncnn_33             1 2 1155 1155_splitncnn_0 1155_splitncnn_1
Convolution              Conv_201                 1 1 1155_splitncnn_1 1157 0=64 1=3 4=1 5=1 6=288576 9=2 -23310=1,1.000000e-01
Concat                   Concat_203               2 1 1157 1155_splitncnn_0 1158
Split                    splitncnn_34             1 2 1158 1158_splitncnn_0 1158_splitncnn_1
Convolution              Conv_204                 1 1 1158_splitncnn_1 1160 0=32 1=3 4=1 5=1 6=162720 9=2 -23310=1,1.000000e-01
Concat                   Concat_206               2 1 1160 1158_splitncnn_0 1161
Split                    splitncnn_35             1 2 1161 1161_splitncnn_0 1161_splitncnn_1
Convolution              Conv_207                 1 1 1161_splitncnn_1 1162 0=2 1=3 4=1 5=1 6=10746
Deconvolution            ConvTranspose_208        1 1 1162 1163 0=2 1=4 3=2 4=1 5=1 6=64
Split                    splitncnn_36             1 2 1163 1163_splitncnn_0 1163_splitncnn_1
Deconvolution            ConvTranspose_209        1 1 1161_splitncnn_0 1164 0=2 1=4 3=2 4=1 5=1 6=19104
BinaryOp                 Mul_211                  1 1 1163_splitncnn_1 1166 0=2 1=1 2=5.000000e+00
dain.OpticalFlowWarp     OpticalFlowWarp_1172     2 1 989_splitncnn_0 1166 1172
dain.Correlation         Corr_1178                2 1 983_splitncnn_1 1172 1178
ReLU                     LeakyRelu_224            1 1 1178 1179 0=1.000000e-01
Concat                   Concat_225               4 1 1179 983_splitncnn_0 1163_splitncnn_0 1164 1180
Split                    splitncnn_38             1 2 1180 1180_splitncnn_0 1180_splitncnn_1
Convolution              Conv_226                 1 1 1180_splitncnn_1 1182 0=128 1=3 4=1 5=1 6=134784 9=2 -23310=1,1.000000e-01
Concat                   Concat_228               2 1 1182 1180_splitncnn_0 1183
Split                    splitncnn_39             1 2 1183 1183_splitncnn_0 1183_splitncnn_1
Convolution              Conv_229                 1 1 1183_splitncnn_1 1185 0=128 1=3 4=1 5=1 6=282240 9=2 -23310=1,1.000000e-01
Concat                   Concat_231               2 1 1185 1183_splitncnn_0 1186
Split                    splitncnn_40             1 2 1186 1186_splitncnn_0 1186_splitncnn_1
Convolution              Conv_232                 1 1 1186_splitncnn_1 1188 0=96 1=3 4=1 5=1 6=322272 9=2 -23310=1,1.000000e-01
Concat                   Concat_234               2 1 1188 1186_splitncnn_0 1189
Split                    splitncnn_41             1 2 1189 1189_splitncnn_0 1189_splitncnn_1
Convolution              Conv_235                 1 1 1189_splitncnn_1 1191 0=64 1=3 4=1 5=1 6=270144 9=2 -23310=1,1.000000e-01
Concat                   Concat_237               2 1 1191 1189_splitncnn_0 1192
Split                    splitncnn_42             1 2 1192 1192_splitncnn_0 1192_splitncnn_1
Convolution              Conv_238                 1 1 1192_splitncnn_1 1194 0=32 1=3 4=1 5=1 6=153504 9=2 -23310=1,1.000000e-01
Concat                   Concat_240               2 1 1194 1192_splitncnn_0 1195
Split                    splitncnn_43             1 2 1195 1195_splitncnn_0 1195_splitncnn_1
Convolution              Conv_241                 1 1 1195_splitncnn_1 1196 0=2 1=3 4=1 5=1 6=10170
Convolution              Conv_242                 1 1 1195_splitncnn_0 1198 0=128 1=3 4=1 5=1 6=650880 9=2 -23310=1,1.000000e-01
Convolution              Conv_244                 1 1 1198 1200 0=128 1=3 2=2 4=2 5=1 6=147456 9=2 -23310=1,1.000000e-01
Convolution              Conv_246                 1 1 1200 1202 0=128 1=3 2=4 4=4 5=1 6=147456 9=2 -23310=1,1.000000e-01
Convolution              Conv_248                 1 1 1202 1204 0=96 1=3 2=8 4=8 5=1 6=110592 9=2 -23310=1,1.000000e-01
Convolution              Conv_250                 1 1 1204 1206 0=64 1=3 2=16 4=16 5=1 6=55296 9=2 -23310=1,1.000000e-01
Convolution              Conv_252                 1 1 1206 1208 0=32 1=3 4=1 5=1 6=18432 9=2 -23310=1,1.000000e-01
Convolution              Conv_254                 1 1 1208 1209 0=2 1=3 4=1 5=1 6=576
BinaryOp                 Add_255                  2 1 1196 1209 1210
BinaryOp                 Mul_257                  1 1 1210 1212 0=2 1=1 2=2.000000e+01
Interp                   Resize_261               1 1 1212 flow 0=2 1=4.000000e+00 2=4.000000e+00
